; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v3 ?v10)
             (pred_11 ?v13 ?v4)
             (pred_5 ?v3 ?v4)
             (pred_8 ?v1 ?v3 )
	     (pred_2 ?v3)
             (pred_3 ?v7)
             (pred_4 ?v13)
             (pred_1 ?v4)
             (pred_12 ?v3)
             (pred_7 ?v13)
             (pred_10 ?v3)
             (pred_6 ))



(:action op_1
:parameters (?v5 ?v9 ?v2 ?v12)
:precondition (and (pred_3 ?v5) (pred_3 ?v9) (pred_4 ?v2) (pred_1 ?v12)
          (pred_9 ?v5 ?v9) (pred_11 ?v2 ?v12)
                   (pred_5 ?v9 ?v12) (pred_2 ?v5) 
                   (pred_12 ?v9) (pred_7 ?v2))
:effect (and  (pred_10 ?v9) (not (pred_12 ?v9))))


(:action op_3
:parameters (?v5 ?v11)
:precondition (and (pred_3 ?v5) (pred_3 ?v11)
               (pred_2 ?v5) (pred_9 ?v5 ?v11) (pred_10 ?v11))
:effect (and (pred_2 ?v11) (not (pred_2 ?v5))))

(:action op_5
:parameters (?v5 ?v2)
:precondition (and (pred_3 ?v5) (pred_4 ?v2) 
                  (pred_2 ?v5) (pred_8 ?v2 ?v5) (pred_6 ))
:effect (and (pred_7 ?v2)
   (not (pred_8 ?v2 ?v5)) (not (pred_6 ))))


(:action op_2
:parameters (?v5 ?v8 ?v6)
:precondition (and (pred_3 ?v5) (pred_4 ?v8) (pred_4 ?v6)
                  (pred_2 ?v5) (pred_7 ?v6) (pred_8 ?v8 ?v5))
:effect (and (pred_7 ?v8) (pred_8 ?v6 ?v5)
        (not (pred_7 ?v6)) (not (pred_8 ?v8 ?v5))))

(:action op_4
:parameters (?v5 ?v2)
:precondition (and (pred_3 ?v5) (pred_4 ?v2) 
                  (pred_2 ?v5) (pred_7 ?v2))
:effect (and (pred_6 ) (pred_8 ?v2 ?v5) (not (pred_7 ?v2)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_05 obj_15 obj_02 obj_18 obj_07 obj_04 obj_17 obj_10 obj_13 obj_08 obj_20 obj_01 obj_19 obj_09 obj_16 obj_11
    obj_03 obj_14
    obj_06 obj_12
    )

    (:init
       (pred_6)

       (pred_3 obj_05)
       (pred_3 obj_15)
       (pred_3 obj_02)
       (pred_3 obj_18)
       (pred_3 obj_07)
       (pred_3 obj_04)
       (pred_3 obj_17)
       (pred_3 obj_10)
       (pred_3 obj_13)
       (pred_3 obj_08)
       (pred_3 obj_20)
       (pred_3 obj_01)
       (pred_3 obj_19)
       (pred_3 obj_09)
       (pred_3 obj_16)
       (pred_3 obj_11)
       (pred_1 obj_03)
       (pred_1 obj_14)
       (pred_4 obj_06)
       (pred_4 obj_12)

       (pred_9 obj_05 obj_07)
       (pred_9 obj_05 obj_15)
       (pred_9 obj_15 obj_04)
       (pred_9 obj_15 obj_02)
       (pred_9 obj_15 obj_05)
       (pred_9 obj_02 obj_17)
       (pred_9 obj_02 obj_18)
       (pred_9 obj_02 obj_15)
       (pred_9 obj_18 obj_10)
       (pred_9 obj_18 obj_02)
       (pred_9 obj_07 obj_13)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_07 obj_05)
       (pred_9 obj_04 obj_08)
       (pred_9 obj_04 obj_17)
       (pred_9 obj_04 obj_15)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_17 obj_02)
       (pred_9 obj_17 obj_04)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_10 obj_18)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_13 obj_19)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_13 obj_07)
       (pred_9 obj_08 obj_09)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_08 obj_04)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_20 obj_16)
       (pred_9 obj_20 obj_01)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_01 obj_11)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_20)
       (pred_9 obj_19 obj_09)
       (pred_9 obj_19 obj_13)
       (pred_9 obj_09 obj_16)
       (pred_9 obj_09 obj_08)
       (pred_9 obj_09 obj_19)
       (pred_9 obj_16 obj_11)
       (pred_9 obj_16 obj_20)
       (pred_9 obj_16 obj_09)
       (pred_9 obj_11 obj_01)
       (pred_9 obj_11 obj_16)
       (pred_12 obj_04)
       (pred_12 obj_10)
       (pred_5  obj_04 obj_03)
       (pred_5  obj_10 obj_14)
       (pred_10 obj_05)
       (pred_10 obj_15)
       (pred_10 obj_02)
       (pred_10 obj_18)
       (pred_10 obj_07)
       (pred_10 obj_17)
       (pred_10 obj_13)
       (pred_10 obj_08)
       (pred_10 obj_20)
       (pred_10 obj_01)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_16)
       (pred_10 obj_11)

       (pred_11  obj_06 obj_03)
       (pred_11  obj_12 obj_14)
       (pred_8 obj_06 obj_13)
       (pred_8 obj_12 obj_16)
       (pred_2 obj_07)
    )

    (:goal (and
       (pred_8 obj_12 obj_11)
    ))
(:constraints
  (always (not (pred_2 obj_20)))
)
)

; plan
1. (op_3 obj_07 obj_13)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_13)
   goals met: 0 of 1
2. (op_3 obj_13 obj_19)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_19)
   goals met: 0 of 1
3. (op_3 obj_19 obj_09)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_09)
   goals met: 0 of 1
4. (op_3 obj_09 obj_16)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_16)
   goals met: 0 of 1
5. (op_5 obj_16 obj_12)
   deleted: (pred_8 obj_12 obj_16) (pred_6)
   added: (pred_7 obj_12)
   goals met: 0 of 1
6. (op_3 obj_16 obj_11)
   deleted: (pred_2 obj_16)
   added: (pred_2 obj_11)
   goals met: 0 of 1
7. (op_4 obj_11 obj_12)
   deleted: (pred_7 obj_12)
   added: (pred_6) (pred_8 obj_12 obj_11)
   goals met: 1 of 1
